app/controllers/user/boats_controller.rb

  def index
    if !params["boat_id"].nil?
      @user = current_user
      @selected_boat = Boat.find(params["boat_id"])
---
SELECT "boats".* FROM "boats" WHERE "boats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @boat = Boat.find(params['id'])
---
SELECT "boats".* FROM "boats" WHERE "boats"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

  def update
    @boat = Boat.find(params['id'])
    # raise
    if params["boat"].nil?
      # removes bug if the update button is selected without any ingredients
      return render :index
    end
    @boat.update(boat_params)
---
SELECT "boats".* FROM "boats" WHERE "boats"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "boats" SET "updated_at" = $1 WHERE "boats"."id" = $2  [["updated_at", "2020-09-29 14:57:28.065439"], ["id", 2]]