app/views/pages/playground.html.erb

<div style="width: 500px; height: 400px;">
  <%= render "shared/map", elements: Boat.all%>
---
SELECT "boats".* FROM "boats" ORDER BY "boats"."id" DESC LIMIT $1  [["LIMIT", 1]]