app/views/user/boats/index.html.erb

        <div class="user-boat-list mt-4">
          <% @user.boats.each do |boat| %>
---
SELECT "boats".* FROM "boats" WHERE "boats"."user_id" = $1  [["user_id", 1]]